const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', function() {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ ?', () => {
  expect(sum(2,5)).toBe(2+5);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
//1. 99 + 77 เท่ากับ 176
test(' 99 + 77 เท่ากับ 176', () => {
  expect(sum(99,77)).toBe(176);
});

//2. 56 + 2 เท่ากับ ?
test('56 + 2 เท่ากับ ?',() => {
  expect(sum(56,2)).toBe(56+2);
});

//3. 123 + 456 เท่ากับ 579
test('123 + 456 เท่ากับ 579', () => {
  expect(sum(123,456)).toBe(579);
});